In [1]:
import pandas as pd

In [8]:
dados = {'Setor':['Frutas', 'Frutas', 'Bebidas', 'Bebidas', 'Carnes', 'Carnes'],
        'Vendedores':['Aline', 'Carlos', 'Aline', 'Joao', 'Flavia', 'Joao'],
        'Venda':[100,200,300,400,500,600]}

In [9]:
df = pd.DataFrame(dados)

In [10]:
df

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [13]:
setor = df.groupby('Setor')

In [14]:
setor.min()

        Vendedores  Venda
Setor
Bebidas      Aline    300
Carnes      Flavia    500
Frutas       Aline    100

In [15]:
setor.mean()

         Venda
Setor
Bebidas  350.0
Carnes   550.0
Frutas   150.0

In [17]:
setor.std()

             Venda
Setor
Bebidas  70.710678
Carnes   70.710678
Frutas   70.710678

In [19]:
setor.max()

        Vendedores  Venda
Setor
Bebidas       Joao    400
Carnes        Joao    600
Frutas      Carlos    200

In [20]:
setor.count()

         Vendedores  Venda
Setor
Bebidas           2      2
Carnes            2      2
Frutas            2      2

In [21]:
sum(df['Venda'])

2100

In [22]:
df.info

<bound method DataFrame.info of      Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600>

In [23]:
df.tail()

     Setor Vendedores  Venda
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500
5   Carnes       Joao    600

In [24]:
df.head()

     Setor Vendedores  Venda
0   Frutas      Aline    100
1   Frutas     Carlos    200
2  Bebidas      Aline    300
3  Bebidas       Joao    400
4   Carnes     Flavia    500

In [25]:
df.describe()

            Venda
count    6.000000
mean   350.000000
std    187.082869
min    100.000000
25%    225.000000
50%    350.000000
75%    475.000000
max    600.000000